// 10 practice problem

// 1. নিচের সংখ্যাগুলোর মধ্যে কোনটা পজিটিভ আর কোনটা নেগেটিভ?
// সংখ্যা: -5, 12, -8, 0, 3.5
// পজিটিভ : 12, 0, 3.5
// নেগেটিভ : -5, -8




// 2. পূর্ণসংখ্যা, জোড় সংখ্যা, আর বিজোড় সংখ্যা আলাদা করে চিহ্নিত কর:
// সংখ্যা: 23, 56, 19.69, 101, 42, 89, 11.37
// পূর্ণসংখ্যা: 23, 56, 101, 42, 89
// জোড় সংখ্যা: 56, 42
// বিজোড় সংখ্যা:  23, 101, 89




// ৩. কোন সংখ্যাগুলো দশমিক আর কোনটা ভগ্নাংশ?
// সংখ্যা: 3.4, 7/8, 2.75, 1/3
// দশমিক সংখ্যা: 3.4, 2.75
// ভগ্নাংশ সংখ্যা: 7/8, 1/3




// ৪. যোগফল কত হবে?
// সংখ্যা: 14 + 21 + 55 = 90
// এবং
// 32 + 47 - 25 = 54




// ৫. তুই যদি 64 টাকার কিছু কিনে 100 টাকা দিস, তাহলে দোকানদার কত টাকা ফেরত দিবে?
// উত্তর: 36




// ৬. পাঁচজনের প্রত্যেককে যদি 350 টাকা করে ইদ বোনাস দেওয়া হয়, তাহলে মোট খরচ কত হবে?
// উত্তর: 1750




// ৭. 450 টাকা যদি ৪ জনের মধ্যে ভাগ করে দিতে হয়, তাহলে প্রত্যেকে কত টাকা করে পাবে? আর যদি কেউ ভাংতি পয়সা না নেয়, তাহলে তোর হাতে কত টাকা বাকি থাকবে?
// উত্তর: প্রত্যেকে 112.5 টাকা পাবে। যদি কেউ ভাংতি না নেয়, তাহলে হাতে 2 টাকা বাকি থাকবে।




// ৮. নিচের সিম্বলগুলো দিয়ে একটা সংখ্যার সাথে আরেকটা সংখ্যার তুলনা করা হচ্ছে। এইসব তুলনার মধ্যে কোনটা সঠিক আর কোনটা ভুল?
// 15 > 12: সঠিক
// 4 < 10: সঠিক
// 7 > 9: ভুল




// ৯. নিচের সংখ্যাগুলোর গড় কত?
// সংখ্যা: 20, 25, 30, 91
// উত্তর: 41.25




// ১০. তোকে একটা ফর্মুলা দেয়া হলো। ফর্মুলাতে বলা আছে, চাকতির ক্ষেত্রফল হবে: nxr²। এখানে পাই -এর মান 3.14, আর হলো ব্যাসার্ধ। আর এইটাও বলে দেয়া আছে।' মানে -এর মানকে দুইবার গুণ করতে হবে। এখন বলা আছে, চাকতির ব্যাসার্ধ -এর মান 7। এখন তুই কি ক্ষেত্রফল বের করতে পারবি?
// উত্তর: ক্ষেত্রফল : 153.86