// 5 practice problem

// ১. export এবং import-এর মধ্যে পার্থক্য কী? উভয় কীভাবে কাজ করে?
export ===> কোনো ফাইল থেকে কোডের কিছু অংশ (যেমন ফাংশন ভেরিয়েবল) বাইরের ফাইলে ব্যবহার করতে চাইলে তাকে export করতে হয়।
import ===> অন্য কোন ফাইল থেকে export করা জিনিসটাকে আনতে হলে import করতে হয়।




// ২. default export কী? এর মাধ্যমে ইমপোর্ট করার সময় কী সুবিধা হয়?
default export মানে হলো: একটা ফাইলে একটি নির্দিষ্ট জিনিসকে প্রধানভাবে এক্সপোর্ট করা। এটা ব্যবহার করলে ইমপোর্ট করার সময় {} ব্যবহার করতে হয় না এবং ইমপোর্ট করার সময় যেকোনো নাম দেওয়া যায়।



// ৩. as কি-ওয়ার্ড কীভাবে নাম পরিবর্তন করতে সাহায্য করে?
as দিয়ে  import  করার সময় চাইলে যেকোনো ইমপোর্টের  নাম চেঞ্জ করে নেওয়া যায়।




// ৪. নাম দিয়ে export আর Default export-এর মধ্যে পার্থক্য কী?
নাম দিয়ে export:

1. এক ফাইলে একাধিক জিনিস এক্সপোর্ট করা যায়
2. ইমপোর্ট করার সময় {} ব্যবহার করতে হয়
3. এক্সপোর্ট করা নাম হুবহু একইভাবে ইমপোর্ট করতে হয়
4. ইচ্ছেমতো নাম পরিবর্তন করা যায় না (unless as ব্যবহার করা হয়)


default export:

1. এক ফাইলে শুধুমাত্র একটি ডিফল্ট এক্সপোর্ট করা যায়
2. ইমপোর্ট করার সময় {} ব্যবহার করতে হয় না
3. ইমপোর্ট করার সময় যেকোনো নাম ব্যবহার করা যায়
4. সাধারণত প্রধান ফাংশন ডিফল্ট হিসেবে এক্সপোর্ট করা হয়




// ৫. এক ফাইল থেকে একাধিক default export কি সম্ভব? কীভাবে সম্ভব?
না, সম্ভব না। এক ফাইলে শুধুমাত্র একটা default export থাকতে পারবে।