// 3 practice problem

// ১. For লুপ দিয়ে 150 থেকে 170 পর্যন্ত সংখ্যা প্রিন্ট কর।
for (let i = 150; i <= 170; i++) {
    console.log(i);
}




// ২. তুই এক স্কুলে 31 থেকে 58 পর্যন্ত ছাত্রদের রোল নাম্বার লিস্ট করবি, তারপর একটা for লুপ ব্যবহার করে সেই সংখ্যাগুলোর যোগফল বের কর।
let sum = 0;
for (let i = 31; i <= 58; i++) {
    sum += i;
}
console.log(sum);




// ৩. For লুপ দিয়ে 25 থেকে 75 পর্যন্ত সংখ্যাগুলোর যোগফল বের কর এবং যোগফল শেষে প্রিন্ট কর।
let total = 0;
for (let i = 25; i <= 75; i++) {
    total += i;
}
console.log("Total Sum:", total);