// 5 practice problem

// 1. while loop দিয়ে 10 বার কনসোেল লগ কর।
let i = 1;
while(i <= 10) {
    console.log(i);
    i++;
}




// 2. 1 থেকে 20 পর্যন্ত সংখ্যা লিখবি একটা while লুপ দিয়ে।
let j = 1;
while(j <= 20) {
    console.log(j);
    j++;
}




// 3. while লুপ দিয়ে 50 থেকে 100 পর্যন্ত সংখ্যা প্রিন্ট কর।
let k = 50;
while(k <= 100) {
    console.log(k);
    k++;
}




// 4. একটা while লুপ দিয়ে 1 থেকে 10 পর্যন্ত সংখ্যাগুলো প্রিন্ট করার সময় সংখ্যাগুলোকে 3 দিয়ে গুণ করে ফেলবি।
let l = 1;
while(l <= 10) {
    console.log(l * 3);
    l++;
}




// 5. একটা while লুপ দিয়ে 111 থেকে 110 পর্যন্ত সংখ্যাগুলো প্রিন্ট করার সময় সংখ্যাগুলোকে 2 দিয়ে ভাগ করে ফেলবি।
let m = 111;
while(m >= 110) {
    console.log(m / 2);
    m--;
}