// 4 practice problem

// ১. জাভাস্ক্রিপ্ট কীভাবে কোড রান করে?
// জাভাস্ক্রিপ্ট ইঞ্জিন (যেমন V8) কোডকে প্রথমে পার্স করে AST তৈরি করে, এরপর ব্যাইটকোডে রূপান্তর করে এবং অবশেষে JIT Compiler দিয়ে মেশিন কোডে রূপান্তর করে এক্সিকিউট করে।




// ২. What is JavaScript?
// জাভাস্ক্রিপ্ট হলো একটি হাই-লেভেল, মাল্টি-প্যারাডাইম, ডায়নামিক্যালি টাইপড ও প্রোটোটাইপ-ভিত্তিক ল্যাঙ্গুয়েজ যা ওয়েব ইন্টারঅ্যাকশন ও অ্যাপ্লিকেশন তৈরিতে ব্যবহৃত হয়।




// ৩. JIT compiled process বোঝানোর জন্য একটি ধাপের flowchart কোড লিখ।
// Source Code → AST → Bytecode → JIT Compiler → Machine Code → Execution




// ৪. জাভাস্ক্রিপ্টে Memory management এবং garbage collection প্রসেস কীভাবে কাজ করে।
// জাভাস্ক্রিপ্ট প্রয়োজন অনুযায়ী অটোমেটিক মেমোরি বরাদ্দ করে এবং অপ্রয়োজনীয় ডেটা ‘mark and sweep’ অ্যালগরিদমের মাধ্যমে গারবেজ কালেক্টর দিয়ে সরিয়ে ফেলে।