// 7 practice problem

// ১. তোর জন্মসালটি একটা ভেরিয়েবলে রাখ।
const myBirthDate = 2004



// ২. তোরা কয় ভাই-বোন, সেটা একটা ভেরিয়েবলে রাখ।
const Siblings = 1;



// ৩. তোর ক্লাসে কতজন স্টুডেন্ট আছে, তাদের সংখ্যা দিয়ে students নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
let students = 20



// ৪. লাস্ট পরীক্ষায় কত নাম্বার পাইছিলি, সেটা দিয়ে marks নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
let marks = 67



// ৫. তোর বাসায় কয়টা রুম আছে, সেটা নিয়ে rooms নামক একটা ভেরিয়েবল ডিক্লেয়ার কর।
const rooms = 4



// ৬. তোর দৈনিক পড়াশোনার সময়কে ঘণ্টা হিসেবে একটা ভেরিয়েবলে রাখ।
let hours = 2



// ৭. তোর ফোন নাম্বারে যতগুলো ডিজিট বা অঙ্ক আছে, সেগুলোকে যোগ করে যোগফল total নামে একটা ভেরিয়েবলে রাখ।
const total = 32