// 7 practice problem

// ১. তোর বর্তমান বয়স age নামে একটা ভেরিয়েবলে রাখ। কনসোলে তারপর এই ভেরিয়েবলটি প্রিন্ট কর।
const age = 21
console.log(age)




// ২. তুই এই বছর যে কয়টা বই পড়ার পরিকল্পনা করছস, সেটাকে booksToRead নামে একটা ভেরিয়েবলে রাখ। পরে booksToRead-এর মান কনসোলে আউটপুট দেখা।
let booksToRead = 10
console.log(booksToRead)




// ৩. তুই প্রতিদিন সকাল কয়টার সময় ঘুম থেকে উঠস, সেটাকে wakeUpTime নামে একটা ভেরিয়েবলে ডিক্লেয়ার কর। তারপর wakeUpTime-এর নতুন মান সেট কর এবং কনসোলে আউটপুট হিসেবে দেখা।
let wakeUpTime = 6
console.log(wakeUpTime)




// ৪. আজ সারাদিনে কত ঘণ্টা সময় তুই মোবাইল ফোনে নষ্ট করছস, সেটাকে wastedTime নামে একটা ভেরিয়েবলে এই মান রাখ। তারপর এইটাকে কনসোলে দেখা।
let wastedTime = 6
console.log(wastedTime)




// ৫. এই মুহূর্তে তুই কত টাকা ধার করে রাখছস? সেটাকে borrow নামে একটা ভেরিয়েবলে রাখ।
let borrow = 0
console.log(borrow)




// ৬. তোর প্রিয় টিম অপোজিট টিমকে সর্বোচ্চ কয়টা গোল দিছে এক ম্যাচে। সেটা দিয়ে goals নামে একটা ভেরিয়েবলে লিখে সেটাকে আউটপুট হিসেবে দেখা।
let goals = 13
console.log(goals)




// ৭. তোর বিছানায় কয়টা বালিশ আছে, সেটার জন্য pillow নামে একটা ভেরিয়েবল ডিক্লেয়ার কর। তারপর কনসোলে সেটাকে আউটপুট হিসেবে দেখা।
let pillows = 2
console.log(pillows)

