// 7 practice problem

// ১. তোর বর্তমান বয়স age নামে একটা ভেরিয়েবলে রাখ। কনসোলে প্রিন্ট কর। তারপর age ভেরিয়েবলে নতুন মান সেট কর এবং আবার কনসোলে প্রিন্ট কর।
let age = 21
console.log(age)
age = 22
console.log(age)




// ২. তোর পকেটে এখন 500 টাকা আছে, pocketMoney নামে একটা ভেরিয়েবলে রাখ। পরে pocketMoney-এর মান 150 সেট কর এবং কনসোলে প্রিন্ট কর।
let pocketMoney = 500
pocketMoney = 150
console.log(pocketMoney)




// ৩. তুই 4 ঘণ্টা পড়াশোনা করার পরিকল্পনা করেছিস, studyTime নামে একটা ভেরিয়েবলে রাখ। পরে study Time-এর মান আপডেট করে তুই আসলেই আজকে যত ঘণ্টা পড়াশোনা করছস, সেটা সেট কর। মান যদি শূন্য হয়, তাহলে ০-ই সেট কর এবং কনসোলে দেখ।
let studyTime = 4
studyTime = 1
console.log(studyTime)




// ৪. তোর মোট 3 জন বন্ধু আছে, friendsCount নামে একটা ভেরিয়েবলে এই সংখ্যা রাখ। পরে তোর 2 জন ফ্রেন্ড তোকে ছেড়ে চলে গেল। এখন friendsCount- এর মান আপডেট কর এবং কনসোলে সেটার আউটপুট দেখ।
let friendsCount = 3
friendsCount = 1
console.log(friendsCount)




// ৫. তুই একটা নতুন ফোন কিনছিলি 25000 টাকা দিয়ে। সেটা নিয়ে একটা ভেরিয়েবল ডিক্লেয়ার কর। আর এক মাস পর সেই ফোন বিক্রি করতে গিয়েই দেখস, দাম দিতে চায় 12000 মাত্র,। কী আর করবি! phonePrice নামে একটা ভেরিয়েবলের মান প্রথমে 25000 দিবি। তারপর সেটাকে 12000 দিয়ে আপডেট কর এবং কনসোলে দেখা।
let phonePrice = 25000
phonePrice = 12000
console.log(phonePrice)




// ৬. তোদের ক্লাসে 40টা চেয়ার আছে। কয়দিন পর 2টা চেয়ারের পা ভেঙে গেল। chairsCount নামে একটা ভেরিয়েবলে এই মান আপডেট কর। আরও কয়দিন পর পাশের রুমের সিনিয়র ভাইয়ারা এসে 6 টি চেয়ার নিয়ে গেছে। এইবারও chairsCount- এর মান আপডেট কর এবং কনসোলে ফাইনাল মান আউটপুট করে দেখ।
let chairsCount = 40
chairsCount = 38
chairsCount = 32
console.log(chairsCount)




// ৭. তুই আজকে 3 ঘণ্টা খেলা করার পরিকল্পনা করেছিস, playTime নামে একটা ভেরিয়েবলে রাখ। পরে playTime-এর মান আপডেট করে আসলেই তুই কত ঘণ্টা খেলা করেছিস, সেটি সেট কর। যদি তুই না খেলিস, তাহলে playTime- এর মান ০ সেট কর এবং কনসোলে দেখ।
let playTime = 3
playTime = 0
console.log(playTime)