// 7 practice problem

// ১. তুই আর তোর ছোট ভাইয়ের মধ্যে খাবার কে বেশি খেয়েছে, সেটা তুলনা করবি। তুই 7টা স্যান্ডউইচ খেয়েছিস, আর তোর ছোট ভাই ১টা খেয়েছে। একটা প্রোগ্রাম লিখে দেখ, কে বেশি খেয়েছে।
const me = 7
const myBrother = 1
console.log(me > myBrother)




// ২. তোর ক্লাসে 45 জন ছাত্র আছে, আর পাশের ক্লাসে 50 জন। একটা প্রোগ্রাম লিখে দেখ, কোন ক্লাসে বেশি ছাত্র আছে।
const myClass = 45
const otherClass = 50
console.log(myClass < otherClass)




// ৩. তুই আর তোর বন্ধু পরীক্ষায় নাম্বার পেয়েছিস। তুই 75 পেয়েছিস, আর তোর বন্ধু পেয়েছে 75। একটা প্রোগ্রাম লিখে চেক কর, তোর আর তোর বন্ধুর নাম্বার সমান কি না।
const myNumber = 75
const myFriendNumber = 75
console.log(myNumber == myFriendNumber)




// ৪. তুই 100 টাকা জমানোর টার্গেট করেছিস। এখন পর্যন্ত 95 টাকা জমাইছিস। একটা প্রোগ্রাম লিখে চেক কর, তুই টার্গেটে পৌঁছাইছিস কি না বা তার চেয়ে বেশি জমাইছিস কি না।
const targetedTaka = 100
const actualTaka = 95
console.log(targetedTaka <= actualTaka)



// ৫. একটা প্রোগ্রাম লিখে দেখ, 10 এবং 7 কি অ-সমান (Different)।
console.log(10 != 7)




// ৬. 20 কি 15-এর চাইতে কম বা সমান কি না, সেটা চেক কর।
console.log(20 >= 15)




// ৭. তুই আর তোর বন্ধু একই সাথে পরীক্ষা দিছস। পরীক্ষার দেয়ার পর তোর বন্ধু কেঁদে কেঁদে বুক ভাসিয়ে ফেলছে। তার পরীক্ষা জঘন্য হইছে, সে ফেল করবে। এক মাস পরে রেজাল্টে দেখা গেছে, তুই পাইছস 45 নাম্বার আর বন্ধু পাইছে 97 নাম্বার। এইবার চেক করে দেখ, তোর বন্ধু কি তোর চাইতে কম নাম্বার পাইছে কি না।
const myExamNumber = 45
const myFriendExamNumber = 97
console.log(myExamNumber <= myFriendExamNumber)